DoS Testmessages/WCF-1_originalMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Action>http://tempuri.org/IAdminConfig/getAdminToken</wsa:Action>
      <wsa:To>http://localhost:8081/wcf-1</wsa:To>
   </soapenv:Header>
   <soapenv:Body>
      <tem:getAdminToken/>
   </soapenv:Body>
</soapenv:Envelope>